
!!!命令コマンドの基本形(command();) 
命令コマンドは全て次のような構造を取る．
<<<maple
> command(引数1,引数2,...);
>>>
あるいは
<<<maple
> command(引数1,オプション1,オプション2,...);
>>>
となる．


1.  ()の中の引数やオプションの間はコンマで区切る．

2.  最後の;（セミコロン）は次のコマンドとの区切り記号．

3.  セミコロン(;)をコロン(:)に替えるとMapleからの返答が出力されなくなるが，Mapleへの入力は行われている．

4.  C言語などの手続き型プログラミング言語の標準的なフォーマットと同じ．

命令コマンドを，英語の命令文と解釈してもよい．たとえば，
<<<maple
sin(x)をxについて0からpiまでplotせよ．
>>>
という日本語を英語に訳すと，
<<<maple
plot sin(x) with x from 0 to Pi.
>>>
となる．この英語をMaple語に訳して
<<<maple
> plot(sin(x),x=0..Pi);
>>>
となったとみなせる．英語文法のVerb (動詞), Object (目的語)を当てはめると，Mapleへの命令は，
<<<maple
> Verb(Object, その他の修飾);
>>>
である．英文でピリオドを忘れるなと中学時代に言われたのと同じく，Mapleでセミコロンを忘れぬように．

