> restart; Digits:=40; func:=unapply(exp(-x)-x^2,x);
                                      40
                2
x -> exp(-x) - x 
> plot(func(x),x=-5..5,y=-10..10);

> x0:=fsolve(func(x)=0,x);
                  0.7034674224983916520498186018599021303429
> x1:=0: x2:=0.8: res1:=[]:
> f1:=func(x1): f2:=func(x2):
> for i from 1 to 20 do
> x:=(x1+x2)/2;
> f:=func(x);
> if f*f1>=0.0 then
> x1:=x; f1:=f;
> else
> x2:=x; f2:=f;
> end if;
> printf("%20.15f, %20.15f\n",x,f); res1:=[op(res1),[i,abs(x-x0)]]:
> end do:
> 
0.400000000000000, 0.510320046035639 0.600000000000000, 0.188811636094026
0.700000000000000, 0.006585303791410 0.750000000000000, -0.090133447258985
0.725000000000000, -0.041300431044638 0.712500000000000, -0.017239627924094
0.706250000000000, -0.005297738100147 0.703125000000000, 0.000651131301199
0.704687500000000, -0.002321465341745 0.703906250000000, -0.000834707623705
0.703515625000000, -0.000091673326854 0.703320312500000, 0.000279757693928
0.703417968750000, 0.000094049360456 0.703466796875000, 0.000001189811060
0.703491210937500, -0.000045241309329 0.703479003906250, -0.000022025636993
0.703472900390625, -0.000010417884931 0.703469848632812, -0.000004614029927
0.703468322753906, -0.000001712107681 0.703467559814453, -0.000000261147873
> with(plots): l1:=logplot(res1);
      /      /[                                                  
  PLOT\CURVES\[[1., 0.3034674224983916520498186018599021303429], 

    [2., 0.1034674224983916520498186018599021303429], 

    [3., 0.003467422498391652049818601859902130342900], 

    [4., 0.04653257750160834795018139814009786965710], 

    [5., 0.02153257750160834795018139814009786965710], 

    [6., 0.009032577501608347950181398140097869657100], 

    [7., 0.002782577501608347950181398140097869657100], 

    [8., 0.0003424224983916520498186018599021303429000], 

    [9., 0.001220077501608347950181398140097869657100], 

    [10., 0.0004388275016083479501813981400978696571000], 

    [11., 0.00004820250160834795018139814009786965710000], 

    [12., 0.0001471099983916520498186018599021303429000], 

    [13., 0.00004945374839165204981860185990213034290000], 

    [                                                 -7]  
    [14., 6.256233916520498186018599021303429000000 10  ], 

    [15., 0.00002378843910834795018139814009786965710000], 

    [16., 0.00001158140785834795018139814009786965710000], 

    [17., 0.000005477892233347950181398140097869657100000], 

    [18., 0.000002426134420847950181398140097869657100000], 

    [                                                 -7]  
    [19., 9.002555145979501813981400978696571000000 10  ], 

    [                                                 -7]]  
    [20., 1.373160614729501813981400978696571000000 10  ]], 

                                                                         \  
    COLOUR(RGB, 1.00000000, 0., 0., _ATTRIBUTE("source" = "mathdefault"))/, 

                                                                  \
    AXESLABELS("", ""), VIEW(DEFAULT, DEFAULT), _AXIS[2](_MODE(1))/
> dfunc:=unapply(diff(func(z),z),z);
z -> -exp(-z) - 2 z
> x0;
                  0.7034674224983916520498186018599021303429
> x:=1.0: f:=func(x): printf("%15.10f, %+24.25f\n",x,f); res2:=[[1,abs(x-x0)]]:
> for i from 2 to 5 do
> x:=x-f/dfunc(x);
> f:=func(x);
> printf("%15.10f, %+24.25f\n",x,f); res2:=[op(res2),[i,abs(x-x0)]]:
> end do:
> 
1.0000000000, -0.6321205588285576784044762 0.7330436052,
-0.0569084480040254074684576 0.7038077863, -0.0006473915387465014761973
0.7034674683, -0.0000000871660305624231097 0.7034674225,
-0.0000000000000015809178420
> l2:=logplot(res2);
      /      /[                                                  
  PLOT\CURVES\[[1., 0.2965325775016083479501813981400978696571], 

    [2., 0.02957618274705375814030928017554642910280], 

    [3., 0.0003403638257413352305700412874342490018000], 

    [                                                -8]  
    [4., 4.583340585430661491600735753912590000000 10  ], 

    [                                                -16]]  
    [5., 8.312739483679342367981829000000000000000 10   ]], 

                                                                         \  
    COLOUR(RGB, 1.00000000, 0., 0., _ATTRIBUTE("source" = "mathdefault"))/, 

                                                                  \
    AXESLABELS("", ""), VIEW(DEFAULT, DEFAULT), _AXIS[2](_MODE(1))/
> display(l1,l2);

> res1[1];
               [1, 0.3034674224983916520498186018599021303429]
> 
